run/steady/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-0.5  0.0 -1.5)
    ( 0.5  0.0 -1.5)
    ( 0.5  1.0 -1.5)
    (-0.5  1.0 -1.5)
    (-0.5  0.0  3.0)
    ( 0.5  0.0  3.0)
    ( 0.5  1.0  3.0)
    (-0.5  1.0  3.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 90) simpleGrading (1 1 1)
);

edges ();

boundary
(
    inlet   { type patch;  faces ((0 3 2 1)); }
    outlet  { type patch;  faces ((4 5 6 7)); }
    ground  { type wall;   faces ((0 1 5 4)); }
    top     { type patch;  faces ((3 7 6 2)); }
    sides
    {
        type patch;
        faces ((0 4 7 3) (1 2 6 5));
    }
);


// ************************************************************************* //
